import React from "react";

const Sidebar = () => {
  return (
    <div className="fixed bottom-0 left-0 right-0 pt-2.5 pb-1 bg-white">
      <div className="container">
        <div className="flex justify-center items-center">
          <div className="w-1/2 flex flex-col gap-1.5 text-gray-001 text-xs text-center items-center cursor-pointer">
            <svg
              width="20"
              height="16"
              viewBox="0 0 20 16"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M16.3076 10.7992L20 14.4754L18.4895 16L14.6292 12.136C13.6853 12.658 12.5943 12.9508 11.4611 12.9508C7.87336 12.9508 4.957 10.0473 4.957 6.47539C4.957 2.9035 7.87336 0 11.4611 0C15.0488 0 17.9859 2.9035 17.9859 6.47539C17.9859 8.14638 17.3354 9.67098 16.3076 10.7992ZM7.11876 6.47539C7.11876 8.8776 9.04889 10.7992 11.4617 10.7992C13.8746 10.7992 15.8047 8.8776 15.8047 6.47539C15.8047 4.07319 13.8746 2.15156 11.4617 2.15156C9.04889 2.15156 7.11876 4.07319 7.11876 6.47539Z"
                fill="#B5B5B5"
              />
              <path d="M0 1.4189H4.95768V3.06418H0V1.4189Z" fill="#B5B5B5" />
              <path d="M0 6.35473H3.30512V8.00001H0V6.35473Z" fill="#B5B5B5" />
              <path d="M0 11.2906H4.95768V12.9358H0V11.2906Z" fill="#B5B5B5" />
            </svg>

            <p className="leading-[14px]">Поиск</p>
          </div>

          <div className="w-1/2 flex flex-col gap-1.5 text-gray-001 text-xs text-center items-center cursor-pointer">
            <svg
              width="20"
              height="16"
              viewBox="0 0 20 16"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M2.71313 0.510996C0.253977 1.72832 -0.688712 4.62858 0.532367 7.22152C1.42913 9.12589 4.91951 12.4911 8.88255 15.2723L9.91973 16L11.0903 15.1631C14.9957 12.3705 18.581 8.9071 19.387 7.14801C20.8739 3.90401 18.8923 0.33725 15.4657 0.0895465C13.7079 -0.037617 12.7972 0.321577 11.2538 1.75018L9.93408 2.97214L8.72669 1.83032C6.76184 -0.0281235 4.7111 -0.477833 2.71313 0.510996ZM8.32378 4.41068C7.43342 3.47196 6.3437 2.55312 5.90238 2.36856C5.46128 2.18421 4.97272 2.04689 4.81707 2.06345C2.64514 2.29416 1.54239 4.09564 2.32237 6.1382C2.91735 7.69574 8.86732 13.2927 9.92812 13.2927C10.3527 13.2927 14.0978 10.1818 15.815 8.4033C18.0867 6.0499 18.4496 4.39235 17.0084 2.95139C15.5257 1.4687 13.953 1.89015 11.562 4.41068L9.94291 6.11767L8.32378 4.41068Z"
                fill="#B5B5B5"
              />
            </svg>

            <p className="leading-[14px]">Вишлист</p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Sidebar;
